
source ../../common/common.tcl

set link_library          "$Std_cell_lib $Ram_lib"
set target_library        "$Std_cell_lib $Ram_lib"
set dc_allow_rtl_pg	  true

source $analyze_script
elaborate ${DESIGN_NAME} -architecture verilog -library WORK

current_design ${DESIGN_NAME}

link

set_fix_multiple_port_nets -outputs -feedthroughs 
source $Warning_file

check_design
link

compile

report_timing > ../../reports/${DESIGN_NAME}_timing_reports.log
report_qor > ../../reports/${DESIGN_NAME}_qor_reports.log
report_area -hierarchy  > ../../reports/${DESIGN_NAME}_area_reports.log
report_power -hierarchy > ../../reports/${DESIGN_NAME}_power_reports.log

change_names -rules verilog
write_file -format verilog -hierarchy -pg -output $Core_compile 

quit
