#@ # 
#@ # Running icc2_shell Version U-2022.12 for linux64 -- Dec 11, 2022
#@ # Date:   Fri May 24 19:22:10 2024
#@ # Run by: hungpt@vku-truongsa
#@ 

gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
open_lib /home/users/hungpt/icdesign/m3/lab05/pnr/i2c_master_top.dlib -edit
open_block /home/users/hungpt/icdesign/m3/lab05/pnr/i2c_master_top.dlib:11_i2c_master_top_route_finish.design
link_block
win_set_filter -visible -class cell -filter {clock_margin hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class pseudo_bump -filter {deleted}
win_set_filter -visible -class pseudo_tsv -filter {deleted}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-72}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array clock_margin hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class pseudo_bump -filter {deleted}
win_set_filter -class pseudo_tsv -filter {deleted}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-72}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
write_parasitics -output ../results/i2c_master_top.max.spef -no_name_mapping  -compress -hierarchical -rde_corr -format spef -corner slow
exit
